In [12]:
import pandas as pd
import numpy as np

In [2]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

Converting a multidimensional array in DataFrame

In [4]:
from numpy.random import randn as rn
np.random.seed(101)
matrix_data=rn(5,4)
matrix_data

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [5]:
#converting multi-dimension array in dataframe with default index
pd.DataFrame(matrix_data)

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [8]:
#giving row name and col name
row_labels=['A','B','C','D','E']
col_labels=['W','X','Y','Z']
df=pd.DataFrame(matrix_data,row_labels,col_labels)

In [9]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Extracting data from various areas

In [10]:
#single colume vaue -series
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
#multiple col-dataframe
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

# Loc

In [18]:
#for rows to extract using custome index
df.loc['E']
#type(df.loc['E'])

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

# iLoc-integer location

In [19]:
#to extract data from default index like 0,1,2
df.iloc[4]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

# See below

In [23]:
row_labels=[12,34,56,67,11]
col_labels=['W','X','Y','Z']
df1=pd.DataFrame(matrix_data,row_labels,col_labels)
df1

           W         X         Y         Z
12  2.706850  0.628133  0.907969  0.503826
34  0.651118 -0.319318 -0.848077  0.605965
56 -2.018168  0.740122  0.528813 -0.589001
67  0.188695 -0.758872 -0.933237  0.955057
11  0.190794  1.978757  2.605967  0.683509

In [25]:
df1.iloc[56] #this will throw error

IndexError: single positional indexer is out-of-bounds

In [26]:
#but this will not as iloc will only understand default index from 0 to n
df1.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: 56, dtype: float64

In [28]:
#but loc will understand custome index
df1.loc[56]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: 56, dtype: float64

In [30]:
df1.loc[[56,11,12]]

           W         X         Y         Z
56 -2.018168  0.740122  0.528813 -0.589001
11  0.190794  1.978757  2.605967  0.683509
12  2.706850  0.628133  0.907969  0.503826

In [31]:
#extracting row and columns
df.iloc[[4,1,2],[1]]

          X
E  1.978757
B -0.319318
C  0.740122

In [32]:
df1.iloc[[1,2],[1,2]]

           X         Y
34 -0.319318 -0.848077
56  0.740122  0.528813

In [35]:
df1.loc[[34,56],['X','Y']]

           X         Y
34 -0.319318 -0.848077
56  0.740122  0.528813

In [ ]:
Example-1

In [39]:
df1.loc[[12],['W']]
df1.loc[[12],['Z']]
df1.loc[[11],['W']]
df1.loc[[11],['Z']]

           Z
11  0.683509

In [42]:
df1.iloc[[0,4],[0,3]]

           W         Z
12  2.706850  0.503826
11  0.190794  0.683509

In [ ]:
Example-LOC

In [76]:
df1

           W         X         Y         Z
12  2.706850  0.628133  0.907969  0.503826
34  0.651118 -0.319318 -0.848077  0.605965
56 -2.018168  0.740122  0.528813 -0.589001
67  0.188695 -0.758872 -0.933237  0.955057
11  0.190794  1.978757  2.605967  0.683509

In [79]:
df1.loc[34:67,'W':'Y']

           W         X         Y
34  0.651118 -0.319318 -0.848077
56 -2.018168  0.740122  0.528813
67  0.188695 -0.758872 -0.933237

In [85]:
df1.drop('New',axis=1)

           W         X         Y         Z
12  2.706850  0.628133  0.907969  0.503826
34  0.651118 -0.319318 -0.848077  0.605965
56 -2.018168  0.740122  0.528813 -0.589001
67  0.188695 -0.758872 -0.933237  0.955057
11  0.190794  1.978757  2.605967  0.683509

Adding two col and creating a new one

In [87]:
df1['New']=df1['X']+df1['Z']
df1['New (Sum of X and Z)']=df1['X']+df1['Z']
df1

           W         X         Y         Z       New  New (Sum of X and Z)
12  2.706850  0.628133  0.907969  0.503826  1.131958              1.131958
34  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
56 -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
67  0.188695 -0.758872 -0.933237  0.955057  0.196184              0.196184
11  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

Dropping a row and col

In [88]:
df1

           W         X         Y         Z       New  New (Sum of X and Z)
12  2.706850  0.628133  0.907969  0.503826  1.131958              1.131958
34  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
56 -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
67  0.188695 -0.758872 -0.933237  0.955057  0.196184              0.196184
11  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

In [90]:
#for dropping a col
df1.drop('New',axis=1)

           W         X         Y         Z  New (Sum of X and Z)
12  2.706850  0.628133  0.907969  0.503826              1.131958
34  0.651118 -0.319318 -0.848077  0.605965              0.286647
56 -2.018168  0.740122  0.528813 -0.589001              0.151122
67  0.188695 -0.758872 -0.933237  0.955057              0.196184
11  0.190794  1.978757  2.605967  0.683509              2.662266

In [91]:
#for dropping a row
df1.drop(67)

           W         X         Y         Z       New  New (Sum of X and Z)
12  2.706850  0.628133  0.907969  0.503826  1.131958              1.131958
34  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
56 -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
11  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

Dropping permanently using inplace=True

In [93]:
df1.drop('New',axis=1,inplace=True)
df1

           W         X         Y         Z  New (Sum of X and Z)
12  2.706850  0.628133  0.907969  0.503826              1.131958
34  0.651118 -0.319318 -0.848077  0.605965              0.286647
56 -2.018168  0.740122  0.528813 -0.589001              0.151122
67  0.188695 -0.758872 -0.933237  0.955057              0.196184
11  0.190794  1.978757  2.605967  0.683509              2.662266

In [2]:
df1.drop(67,inplace=True)
df1

NameError: name 'df1' is not defined

multi-indexing

In [5]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
heir_index=list(zip(outside,inside))
print(heir_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [10]:
hier_index=pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [14]:
from numpy.random import randn as rn

In [16]:
print('\n Creating dataframe with multi-index\n','-'*37,sep='')
df1=pd.DataFrame(data=np.round(rn(6,3)),index=hier_index,columns=['A','B','C'])
df1

 Creating dataframe with multi-index
-------------------------------------

        A    B    C
G1 1 -1.0 -0.0  1.0
   2  1.0 -0.0  1.0
   3  1.0  1.0  0.0
G2 1  1.0  1.0 -2.0
   2 -1.0  2.0 -0.0
   3 -0.0 -1.0 -1.0

Extracting from multi-index

In [19]:
df1.loc['G1']

     A    B    C
1 -1.0 -0.0  1.0
2  1.0 -0.0  1.0
3  1.0  1.0  0.0

In [21]:
#df1.loc['G1'].loc[[3],['B','C']]
df1.loc['G1'].loc[3,['B','C']]

B    1.0
C    0.0
Name: 3, dtype: float64

Example=3

In [40]:
l1=['A','A','A','B','B','B','C','C','C']
l2=[1,2,3,1,2,3,1,2,3]
l3=[1,2,3,4,5,6,7,8,9]
lst=list(zip(l1,l2,l3))
lst

[('A', 1, 1),
 ('A', 2, 2),
 ('A', 3, 3),
 ('B', 1, 4),
 ('B', 2, 5),
 ('B', 3, 6),
 ('C', 1, 7),
 ('C', 2, 8),
 ('C', 3, 9)]

In [47]:
lst=pd.MultiIndex.from_tuples(lst)
df2=pd.DataFrame(data=np.round(rn(9,4)),index=lst,columns=['abc','mno','pqr','xyz'])
df2

       abc  mno  pqr  xyz
A 1 1 -0.0 -0.0  0.0 -0.0
  2 2  1.0 -0.0 -2.0  1.0
  3 3  1.0  1.0 -1.0 -0.0
B 1 4  2.0 -1.0  2.0  1.0
  2 5  1.0 -0.0  1.0 -2.0
  3 6  1.0 -2.0  0.0  1.0
C 1 7  0.0  0.0 -2.0 -1.0
  2 8  0.0 -0.0 -1.0  1.0
  3 9  0.0  1.0  1.0  0.0

In [58]:
df2.loc['A'].loc[3,3].loc['abc']

1.0

Drop a NaN value

In [64]:
a={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(a)
df['State']='CA NV AZ'.split()
df.set_index('State',inplace=True)

In [65]:
df

         A    B  C
State
CA     1.0  5.0  1
NV     2.0  NaN  2
AZ     NaN  NaN  3

In [66]:
df.dropna()

         A    B  C
State
CA     1.0  5.0  1

In [67]:
df.dropna(thresh=2)

         A    B  C
State
CA     1.0  5.0  1
NV     2.0  NaN  2

In [69]:
df.dropna(thresh=3)

         A    B  C
State
CA     1.0  5.0  1

In [70]:
df.dropna(thresh=4) # atleast 4 and less than 4 will also drop

Empty DataFrame
Columns: [A, B, C]
Index: []

In [71]:
#for col
df.dropna(thresh=2,axis=1)

         A  C
State
CA     1.0  1
NV     2.0  2
AZ     NaN  3